<a href="https://colab.research.google.com/github/rahiakela/coursera-advanced-machine-learning-specialization/blob/course-1-introduction-to-deep-learning/week_1_pandas_basics.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas basics

Hi! In this programming assignment you need to refresh your `pandas` knowledge. You will need to do several [`groupby`](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.groupby.html)s and [`join`]()`s to solve the task.

In [0]:
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
%matplotlib inline 

from grader import Grader

In [0]:
transactions  = pd.read_csv(os.path.join('.', 'sales_train.csv.gz'))
items         = pd.read_csv(os.path.join('.','items.csv'))
item_categories = pd.read_csv(os.path.join('.','item_categories.csv'))
shops         = pd.read_csv(os.path.join('.','shops.csv'))

The dataset we are going to use is taken from the competition, that serves as the final project for this course. You can find complete data description at the [competition web page](https://www.kaggle.com/c/competitive-data-science-final-project/data). To join the competition use [this link](https://www.kaggle.com/t/1ea93815dca248e99221df42ebde3540).

## Grading

We will create a grader instace below and use it to collect your answers. When function `submit_tag` is called, grader will store your answer *locally*. The answers will *not* be submited to the platform immediately so you can call `submit_tag` function as many times as you need. 

When you are ready to push your answers to the platform you should fill your credentials and run `submit` function in the <a href="#Authorization-&-Submission">last paragraph</a>  of the assignment.

In [0]:
grader = Grader()

## Task

Let's start with a simple task.

### Task 1: using shape and head

<ol start="0">
  <li><b>Print the shape of the loaded dataframes and use [`df.head`](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.head.html) function to print several rows. Examine the features you are given.</b></li>
</ol>

In [6]:
transactions.shape

(2935849, 6)

In [14]:
transactions.head()

         date  date_block_num  shop_id  item_id  item_price  item_cnt_day
0  02.01.2013               0       59    22154      999.00           1.0
1  03.01.2013               0       25     2552      899.00           1.0
2  05.01.2013               0       25     2552      899.00          -1.0
3  06.01.2013               0       25     2554     1709.05           1.0
4  15.01.2013               0       25     2555     1099.00           1.0

In [8]:
items.shape

(22170, 3)

In [15]:
items.head()

                                           item_name  item_id  item_category_id
0          ! ВО ВЛАСТИ НАВАЖДЕНИЯ (ПЛАСТ.)         D        0                40
1  !ABBYY FineReader 12 Professional Edition Full...        1                76
2      ***В ЛУЧАХ СЛАВЫ   (UNV)                    D        2                40
3    ***ГОЛУБАЯ ВОЛНА  (Univ)                      D        3                40
4        ***КОРОБКА (СТЕКЛО)                       D        4                40

In [10]:
item_categories.shape

(84, 2)

In [16]:
item_categories.head()

        item_category_name  item_category_id
0  PC - Гарнитуры/Наушники                 0
1         Аксессуары - PS2                 1
2         Аксессуары - PS3                 2
3         Аксессуары - PS4                 3
4         Аксессуары - PSP                 4

In [12]:
shops.shape

(60, 2)

In [17]:
shops.head()

                        shop_name  shop_id
0   !Якутск Орджоникидзе, 56 фран        0
1   !Якутск ТЦ "Центральный" фран        1
2                Адыгея ТЦ "Мега"        2
3  Балашиха ТРК "Октябрь-Киномир"        3
4        Волжский ТЦ "Волга Молл"        4

### Task 2: What was the maximum total revenue among all the shops in September, 2014?

Now use your `pandas` skills to get answers for the following questions. 
The first question is:

1. **What was the maximum total revenue among all the shops in September, 2014** 


* Hereinafter *revenue* refers to total sales minus value of goods returned.

*Hints:*

* Sometimes items are returned, find such examples in the dataset. 
* It is handy to split `date` field into [`day`, `month`, `year`] components and use `df.year == 14` and `df.month == 9` in order to select target subset of dates.
* You may work with `date` feature as with srings, or you may first convert it to `pd.datetime` type with `pd.to_datetime` function, but do not forget to set correct `format` argument.

In [25]:
# extract year, month and day from date coulmn
transactions['year'] = pd.to_datetime(transactions['date']).dt.year
transactions['month'] = pd.to_datetime(transactions['date']).dt.month
transactions['day'] = pd.to_datetime(transactions['date']).dt.day

transactions.head()

         date  date_block_num  shop_id  item_id  ...  item_cnt_day  year  month  day
0  02.01.2013               0       59    22154  ...           1.0  2013      2    1
1  03.01.2013               0       25     2552  ...           1.0  2013      3    1
2  05.01.2013               0       25     2552  ...          -1.0  2013      5    1
3  06.01.2013               0       25     2554  ...           1.0  2013      6    1
4  15.01.2013               0       25     2555  ...           1.0  2013      1   15

[5 rows x 9 columns]

In [33]:
# check the single condition for year
trans_date = transactions.loc[transactions['year'] == 2014]
trans_date.head()

               date  date_block_num  shop_id  ...  year  month  day
1267562  02.01.2014              12       54  ...  2014      2    1
1267563  10.01.2014              12       54  ...  2014     10    1
1267564  24.01.2014              12       54  ...  2014      1   24
1267565  24.01.2014              12       54  ...  2014      1   24
1267566  31.01.2014              12       54  ...  2014      1   31

[5 rows x 9 columns]

In [31]:
# check the single condition for month
trans_date = transactions.loc[transactions['month'] == 9]
trans_date.head()

           date  date_block_num  shop_id  ...  year  month  day
20   09.01.2013               0       25  ...  2013      9    1
96   09.01.2013               0       25  ...  2013      9    1
162  09.01.2013               0       25  ...  2013      9    1
164  09.01.2013               0       25  ...  2013      9    1
166  09.01.2013               0       25  ...  2013      9    1

[5 rows x 9 columns]

In [34]:
# combining both conditions for year and month
trans_date = transactions.loc[(transactions['year'] == 2014) & (transactions['month'] == 9)]
trans_date.head()

               date  date_block_num  shop_id  ...  year  month  day
1267571  09.01.2014              12       54  ...  2014      9    1
1267595  09.01.2014              12       54  ...  2014      9    1
1267605  09.01.2014              12       54  ...  2014      9    1
1267800  09.01.2014              12       54  ...  2014      9    1
1267862  09.01.2014              12       54  ...  2014      9    1

[5 rows x 9 columns]

In [38]:
# count the total sales on this date
total_sales = np.round((trans_date['item_cnt_day'] * trans_date['item_price']).sum())
total_sales

116282853.0

In [39]:
max_revenue = total_sales
grader.submit_tag('max_revenue', max_revenue)

Current answer for task max_revenue is: 116282853.0

### Task 3: What item category generated the highest revenue in summer 2014?

Great! Let's move on and answer another question:

<ol start="2">
  <li><b>What item category generated the highest revenue in summer 2014?</b></li>
</ol>

* Submit `id` of the category found.
    
* Here we call "summer" the period from June to August.

*Hints:*

* Note, that for an object `x` of type `pd.Series`: `x.argmax()` returns **index** of the maximum element. `pd.Series` can have non-trivial index (not `[1, 2, 3, ... ]`).